In [32]:
import sys
sys.path.append('../core')
# importando script
from script_connect_postgres import connect_postgres

In [33]:
import pandas as pd
from decouple import config
from utils.DataUnderstanding import DataUnderstanding

# Estudo sobre o aluguel de filmes:

Conectando ao Postgres:

In [34]:
conn = connect_postgres(
    dbname=config('DBNAME'),
    user=config('USER'),
    password=config('PASSWORD'),
    host=config('HOST'),
    port=config('PORT'),
)

DataFrame:

In [35]:
sql_query = """
SELECT * FROM customer;
"""

In [36]:
df = pd.read_sql_query(
    sql_query,
    conn
)

/tmp/ipykernel_46314/1402424599.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(

In [37]:
display(df.head())

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,True,2022-02-14,2022-02-15 09:57:20+00:00,1
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,True,2022-02-14,2022-02-15 09:57:20+00:00,1
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,True,2022-02-14,2022-02-15 09:57:20+00:00,1
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,True,2022-02-14,2022-02-15 09:57:20+00:00,1
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,True,2022-02-14,2022-02-15 09:57:20+00:00,1

## Código:

In [38]:
class AluguelFilmes(DataUnderstanding):
    pass


if __name__ == '__main__':
    aluguel_filmes = AluguelFilmes()

## Entedimento Dos Dados:

In [39]:
df.head(3)

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,True,2022-02-14,2022-02-15 09:57:20+00:00,1
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,True,2022-02-14,2022-02-15 09:57:20+00:00,1
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,True,2022-02-14,2022-02-15 09:57:20+00:00,1

In [40]:
df.tail(3)

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
596,597,1,FREDDIE,DUGGAN,FREDDIE.DUGGAN@sakilacustomer.org,603,True,2022-02-14,2022-02-15 09:57:20+00:00,1
597,598,1,WADE,DELVALLE,WADE.DELVALLE@sakilacustomer.org,604,True,2022-02-14,2022-02-15 09:57:20+00:00,1
598,599,2,AUSTIN,CINTRON,AUSTIN.CINTRON@sakilacustomer.org,605,True,2022-02-14,2022-02-15 09:57:20+00:00,1

In [41]:
aluguel_filmes.verificando_as_dimensões_do_dataframe(
    dataframe=df,
)

Linhas: 599
Colunas: 10

In [42]:
aluguel_filmes.descrição(
    dataframe=df,
    vertical=True
)

,count,mean,std,min,10%,15%,25%,50%,75%,85%,95%,99%,max
customer_id,599.0,300.00,173.06,1.0,60.8,90.7,150.5,300.0,449.5,509.3,569.1,593.02,599.0
store_id,599.0,1.46,0.50,1.0,1.0,1.0,1.0,1.0,2.0,2.0,2.0,2.00,2.0
address_id,599.0,304.72,173.70,5.0,64.8,94.7,154.5,305.0,454.5,514.3,575.1,599.02,605.0
active,599.0,0.97,0.16,0.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.00,1.0

In [44]:
aluguel_filmes.descrição_object(
    dataframe=df,
    vertical=True,
)

            count unique                            top freq
first_name    599    591                         JESSIE    2
last_name     599    599                          SMITH    1
email         599    599  MARY.SMITH@sakilacustomer.org    1
create_date   599      1                     2022-02-14  599

In [46]:
aluguel_filmes.verificando_tipos(
    dataframe=df
)

                           Tipos
customer_id                int64
store_id                   int64
first_name                object
last_name                 object
email                     object
address_id                 int64
activebool                  bool
create_date               object
last_update  datetime64[ns, UTC]
active                     int64

In [48]:
aluguel_filmes.verificando_valores_nulos(
    dataframe=df
)